# **Week 01**

# 01 : Menyertakan Prefix dan Suffix pada seluruh Kolom Data Frame

## Import Modules

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(pd.__version__)

2.1.3
2.1.3

## Persiapan Data Frame

In [3]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns = cols)
df

   A  B  C  D  E
0  5  6  6  4  8
1  3  2  2  2  7
2  7  2  6  8  9
3  4  6  7  6  6
4  3  4  6  7  2

In [4]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

## Menyertakan Prefix Kolom

In [5]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        5        6        6        4        8
1        3        2        2        2        7
2        7        2        6        8        9
3        4        6        7        6        6
4        3        4        6        7        2

## Menyertakan Suffix Kolom

In [6]:
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        5        6        6        4        8
1        3        2        2        2        7
2        7        2        6        8        9
3        4        6        7        6        6
4        3        4        6        7        2

# 02 : Pemilihan baris (rows selection) pada Data Frame

## Persiapan Data Frame

In [8]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 5, size=(n_rows, n_cols)), 
                  columns = cols)
df

   A  B  C  D  E
0  2  2  2  4  4
1  2  4  4  4  4
2  4  2  2  2  4
3  3  4  1  1  1
4  3  3  4  4  1
5  2  4  1  1  1
6  3  4  2  1  1
7  3  4  4  2  1
8  2  2  3  1  2
9  3  1  4  2  3

## Selection dengan operator logika |

In [9]:
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
3  3  4  1  1  1
4  3  3  4  4  1
6  3  4  2  1  1
7  3  4  4  2  1
9  3  1  4  2  3

## Selection dengan fungsi isin()

In [11]:
df[df['A'].isin([1, 3])]

   A  B  C  D  E
3  3  4  1  1  1
4  3  3  4  4  1
6  3  4  2  1  1
7  3  4  4  2  1
9  3  1  4  2  3

## Mengenal Operator negasi ~

operator negasi digunakan untuk mengenali not

In [12]:
df[-df['A'].isin([1, 3])]

   A  B  C  D  E
0  2  2  2  4  4
1  2  4  4  4  4
2  4  2  2  2  4
5  2  4  1  1  1
8  2  2  3  1  2

# 03 : Konversi tipe data String ke Numerik pada kolom Data Frame

## Persiapan Data Frame

In [16]:
data = {'col1':['1', '2', '3', 'teks'],
        'col2':['1', '2', '3', '4']}
        
df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [17]:
df.dtypes

col1    object
col2    object
dtype: object

## Konversi tipe data dengan fungsi astype()

In [18]:
df_x = df.astype({'col2':'int'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [19]:
df_x.dtypes

col1    object
col2     int32
dtype: object

## Konversi tipe data numerik dengan fungsi to_numeric()

In [20]:
df.apply(pd.to_numeric, errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

# 04 : Pemilihan kolom (columns selection) pada Data Frame berdasarkan tipe data

## Persiapan Data Frame

In [21]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                  columns=cols)
df['bil_pecahan'] = df['bil_pecahan'].astype('float') #menkonversi pecahan menjadi tipe data float menggunakan function astype

df

   bil_pecahan  bil_bulat
0          5.0         17
1          9.0         18
2          1.0         12
3         18.0         17
4         11.0          7

In [25]:
df.index = pd.date_range(start='2023-10-01', periods=n_rows, freq='H')

df = df.reset_index()

df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2023-10-01 00:00:00          5.0         17    A
1 2023-10-01 01:00:00          9.0         18    B
2 2023-10-01 02:00:00          1.0         12    C
3 2023-10-01 03:00:00         18.0         17    D
4 2023-10-01 04:00:00         11.0          7    E

In [26]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

## Memilih kolom bertipe data numerik

In [27]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          5.0         17
1          9.0         18
2          1.0         12
3         18.0         17
4         11.0          7

In [28]:
df.select_dtypes(include='float')

   bil_pecahan
0          5.0
1          9.0
2          1.0
3         18.0
4         11.0

In [29]:
df.select_dtypes(include='int')

   bil_bulat
0         17
1         18
2         12
3         17
4          7

## Memilih kolom bertipe data string atau object

In [31]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

## Memilih kolom bertipe data string atau datetime

In [33]:
df.select_dtypes(include='datetime')

                index
0 2023-10-01 00:00:00
1 2023-10-01 01:00:00
2 2023-10-01 02:00:00
3 2023-10-01 03:00:00
4 2023-10-01 04:00:00

## Memilih kolom dengan kombinasi tipe data

In [34]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0          5.0         17    A
1          9.0         18    B
2          1.0         12    C
3         18.0         17    D
4         11.0          7    E